Heatsink-Optimization-Series/episode-02-baseline/case/constant/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiationModel  none;
